Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/ЖурналПроводок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводок</Name>
			<ChartOfAccounts>ChartOfAccounts.Основной</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Основной.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// 1. Обязательно включаем запись движений по регистрам
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.ЖурналПроводок.Записывать = Истина;
	
	// 2. Подготавливаем таблицу списываемых товаров (исключаем услуги)
	ТаблицаТоваров = СписокНоменклатуры.Выгрузить();
	
	Индекс = ТаблицаТоваров.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Если ТаблицаТоваров[Индекс].Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			ТаблицаТоваров.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Если ТаблицаТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТоваров.Свернуть("Номенклатура", "Количество");
	
	// 3. НАСТРОЙКА УПРАВЛЯЕМОЙ БЛОКИРОВКИ
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	ЭлементБлокировки.ИсточникДанных = ТаблицаТоваров;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	
	// 3.1 Формирование проводок по Выручке (Дт 62 - Кт 90)
	ВидСубконтоКонтрагенты = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Контрагенты");
	ВидСубконтоНоменклатура = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Номенклатура");

	Для Каждого СтрокаТЧ Из СписокНоменклатуры Цикл
		ПроводкаВ = Движения.ЖурналПроводок.Добавить();
		ПроводкаВ.Период = Дата;
		ПроводкаВ.СчетДт = ПланыСчетов.Основной.НайтиПоКоду("62");
		ПроводкаВ.СчетКт = ПланыСчетов.Основной.НайтиПоКоду("90");
		ПроводкаВ.Сумма  = СтрокаТЧ.Сумма;

		// Заполняем аналитику покупателя по Дебету счета 62
		Если ЗначениеЗаполнено(ВидСубконтоКонтрагенты) Тогда
			ПроводкаВ.СубконтоДт[ВидСубконтоКонтрагенты] = Контрагент;
		КонецЕсли;

		// Заполняем аналитику товара по Кредиту счета 90
		Если ЗначениеЗаполнено(ВидСубконтоНоменклатура) Тогда
			ПроводкаВ.СубконтоКт[ВидСубконтоНоменклатура] = СтрокаТЧ.Номенклатура;
		КонецЕсли;
	КонецЦикла;
	   	// 4. ЗАПРОС ДЛЯ ПОЛУЧЕНИЯ ОСТАТКОВ И ПАРТИЙ
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Количество КАК КоличествоВДокументе
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.КоличествоВДокументе КАК КоличествоВДокументе,
		|	ОстаткиНоменклатурыОстатки.Партия КАК Партия,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СтоимостьОстаток, 0) КАК СтоимостьОстаток
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&МоментВремени,
		|				Склад = &Склад
		|					И Номенклатура В (ВЫБРАТЬ ВТ_Товары.Номенклатура ИЗ ВТ_Товары КАК ВТ_Товары)) КАК ОстаткиНоменклатурыОстатки
		|		ПО ВТ_Товары.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	ОстаткиНоменклатурыОстатки.Партия.МоментВремени
		|
		|ИТОГИ
		|	МАКСИМУМ(КоличествоВДокументе)
		|ПО
		|	Номенклатура";

	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());

	РезультатЗапроса = Запрос.Выполнить();

		
	// 5. ОБХОД РЕЗУЛЬТАТОВ ЗАПРОСА И СПИСАНИЕ ПО ПАРТИЯМ
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ОбщийОстаток = 0;
		ВыборкаПодсчет = ВыборкаНоменклатура.Выбрать();
		Пока ВыборкаПодсчет.Следующий() Цикл
			ОбщийОстаток = ОбщийОстаток + ВыборкаПодсчет.КоличествоОстаток;
		КонецЦикла;
		
		Если ОбщийОстаток < ВыборкаНоменклатура.КоличествоВДокументе Тогда
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Недостаточно товара ""%1"" на складе ""%2"". Требуется: %3, В наличии: %4. Нехватка: %5",
				ВыборкаНоменклатура.Номенклатура, Склад, ВыборкаНоменклатура.КоличествоВДокументе, ОбщийОстаток, 
				ВыборкаНоменклатура.КоличествоВДокументе - ОбщийОстаток);
			Сообщение.Сообщить();
			
			Продолжить;
		КонецЕсли;
		
		Если Не Отказ Тогда
			ОсталосьСписать = ВыборкаНоменклатура.КоличествоВДокументе;
			ВыборкаПартий = ВыборкаНоменклатура.Выбрать();
			
			Пока ВыборкаПартий.Следующий() И ОсталосьСписать > 0 Цикл
				
				СписатьИзПартии = Мин(ОсталосьСписать, ВыборкаПартий.КоличествоОстаток);
				
				Если СписатьИзПартии = ВыборкаПартий.КоличествоОстаток Тогда
					СтоимостьСписания = ВыборкаПартий.СтоимостьОстаток;
				Иначе
					СтоимостьСписания = (ВыборкаПартий.СтоимостьОстаток / ВыборкаПартий.КоличествоОстаток) * СписатьИзПартии;
				КонецЕсли;
				
				// Движение оперативного учета
				Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
				Движение.Период       = Дата;
				Движение.Склад        = Склад;
				Движение.Номенклатура  = ВыборкаПартий.Номенклатура;
				Движение.Партия       = ВыборкаПартий.Партия;
				Движение.Количество   = СписатьИзПартии;
				Движение.Стоимость    = СтоимостьСписания;
				
				// Проводка бухгалтерского учета (Дт 90 - Кт 41)
				ПроводкаС = Движения.ЖурналПроводок.Добавить();
				ПроводкаС.Период = Дата;
				ПроводкаС.СчетДт = ПланыСчетов.Основной.НайтиПоКоду("90");
				ПроводкаС.СчетКт = ПланыСчетов.Основной.НайтиПоКоду("41");
				ПроводкаС.Сумма  = СтоимостьСписания;
				ПроводкаС.КоличествоКт = СписатьИзПартии;
				
				Если ЗначениеЗаполнено(ВидСубконтоНоменклатура) Тогда
					ПроводкаС.СубконтоКт[ВидСубконтоНоменклатура] = ВыборкаПартий.Номенклатура;
				КонецЕсли;
				
				ОсталосьСписать = ОсталосьСписать - СписатьИзПартии;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
